# 20.01.2019
/*3) В городе, в котором живут друзья Андрей и Борис, метро состоит из единственной
кольцевой линии, вдоль которой на равном расстоянии друг от друга расположены n
станций, пронумерованных от 1 до n. Участок линии метро между двумя соседними
станциями называется перегоном.
Поезда по кольцевой линии двигаются как по часовой стрелке, так и против часовой
стрелки, поэтому чтобы добраться от одной станции до другой, пассажир может выбрать
то направление, в котором требуется проехать меньше перегонов. Минимальное число
перегонов, которое необходимо проехать, чтобы добраться от одной станции до другой,
назовем расстоянием между станциями.
Друзья заметили, что выполняется следующее условие: если загадать некоторую
станцию X и выписать для нее два числа: Da — расстояние от станции, на которой живет
Андрей, до станции X и Db — расстояние от станции, на которой живет Борис, до станции
X, то полученная пара чисел [Da, Db] будет однозначно задавать станцию X.
Например, если n = 4, Андрей живет на станции 1, а Борис живет на станции 2, то
станция 1 задается парой [0, 1], станция 2 — парой [1, 0], станция 3 — парой [2, 1] и
станция 4 — парой [1, 2].
Их одноклассник Сергей живет в соседнем городе и не знает, на каких станциях
живут Андрей и Борис. Чтобы найти друзей, он заинтересовался, сколько существует
вариантов пар станций A, B, таких что если Андрей живет на станции A, а Борис — на
станции B, то выполняется описанное выше условие.
Требуется написать программу, которая по числу станций n на кольцевой линии
определяет искомое количество вариантов.
Формат входных данных
Первая строка входного файла содержит одно целое число n (3 ≤ n ≤ 40 000)*/



#include <iostream>
using namespace std;
int main()
{
   int n;
   cin >> n;
   n=((n-1)/2)*2*n;
   cout<<n;
    return 0;
}
